
/* 帧类型定义。DATA 用于传输数据，ACK/NAK 用于确认或否认确认。 */
#define FRAME_DATA 1
#define FRAME_ACK  2
#define FRAME_NAK  3

/*  
    DATA 帧格式
    +=========+========+========+===============+========+
    | KIND(1) | SEQ(1) | ACK(1) | DATA(240~256) | CRC(4) |
    +=========+========+========+===============+========+
    KIND：帧类型；SEQ：本数据帧序号；ACK：捎带确认号；
    DATA：网络层数据；CRC：帧校验序列。

    ACK 帧格式
    +=========+========+========+
    | KIND(1) | ACK(1) | CRC(4) |
    +=========+========+========+
    ACK：确认号，表示已经正确收到对应的数据帧。

    NAK 帧格式
    +=========+========+========+
    | KIND(1) | ACK(1) | CRC(4) |
    +=========+========+========+
    NAK：选择重传协议中可用，用来提示对方重传某个出错或缺失的数据帧。
*/

